In [1]:
import pandas as pd, os
import numpy as np

DIR = '../../Data/'
FILE = DIR+'titanic.csv'

In [2]:
titaDF = pd.read_csv(FILE)
titaDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
subtitaDF = titaDF.loc[:5,['Age','Fare']]

In [11]:
subtitaDF['Value']=10
subtitaDF

    Age     Fare  Value
0  22.0   7.2500     10
1  38.0  71.2833     10
2  26.0   7.9250     10
3  35.0  53.1000     10
4  35.0   8.0500     10
5   NaN   8.4583     10

In [12]:
# 사용자 정의 함수 ----------------------------------
def addValue(x):
    print(f'[DEBUG]----------\n {x}')
    return x+x

def addTwoValue(x,y):
    print(f'[DEBUG]----------\n {x}, {y}')
    return x+y

In [13]:
# 사용자 정의 함수 ---------------------------------
def missingValueCheck(sr):
    return sr.isnull()

# 사용자 정의 함수 ---------------------------------
def missingValueSum(sr):
    return sr.isnull().sum()

In [14]:
subtitaDF.applymap(np.sum)

    Age     Fare  Value
0  22.0   7.2500     10
1  38.0  71.2833     10
2  26.0   7.9250     10
3  35.0  53.1000     10
4  35.0   8.0500     10
5   NaN   8.4583     10

In [15]:
subtitaDF.apply(np.sum)

Age      156.0000
Fare     156.0666
Value     60.0000
dtype: float64

In [17]:
subtitaDF.pipe(np.sum)

Age      156.0000
Fare     156.0666
Value     60.0000
dtype: float64